base/DataProcessors/бит_ГрупповаяОплатаЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ГрупповаяОплатаЗаявок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъединятьНазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/Enums/бит_РежимыЗаписиДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыЗаписиДокумента</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/DataProcessors/бит_ГрупповаяОплатаЗаявок/Forms/Настройка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "ОбъединятьНазначениеПлатежа, РежимЗаписиРасчетыЧерезБанк, РежимЗаписиРасчетыЧерезКассу";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
	Если НЕ ЗначениеЗаполнено(РежимЗаписиРасчетыЧерезБанк) Тогда
		РежимЗаписиРасчетыЧерезБанк = Перечисления.бит_РежимыЗаписиДокумента.Запись;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимЗаписиРасчетыЧерезКассу) Тогда
		РежимЗаписиРасчетыЧерезКассу = Перечисления.бит_РежимыЗаписиДокумента.Запись;
	КонецЕсли;

	Элементы.ГруппаРасчетыЧерезКассу.Видимость = Ложь; // Пока не поддерживаем.
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПрограммноеЗакрытие = Не Модифицированность;
	
	ТекстПредупреждения = НСтр("ru = 'Настройки были изменены. Закрыть без сохранения?';
								|en = 'Settings were changed. Close without saving?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтказеОтЗакрытияФормы", ЭтотОбъект); 
	
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект,
		Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ПрограммноеЗакрытие", ОписаниеОповещения);
	
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
//	
&НаКлиенте
Процедура ПриОтказеОтЗакрытияФормы(Результат, ВходящийКонтекст) Экспорт
	
	Модифицированность = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Модифицированность = Ложь;
	
	ПараметрыПередачи = Новый Структура; 
	ПараметрыПередачи.Вставить("ОбъединятьНазначениеПлатежа", ОбъединятьНазначениеПлатежа);
	ПараметрыПередачи.Вставить("РежимЗаписиРасчетыЧерезБанк", РежимЗаписиРасчетыЧерезБанк);
	ПараметрыПередачи.Вставить("РежимЗаписиРасчетыЧерезКассу",РежимЗаписиРасчетыЧерезКассу);
	
	Закрыть(ПараметрыПередачи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Код процедур и функций

#КонецОбласти
